public class Main {
    public static void main(String[] args) {


        // Задача 1
        int age = 19;
        if (age >=18)  {
           System.out.println("Вы совершеннолетний!"); }
        if (age < 18)  {
            System.out.println("Возраст совершеннолетия ещё не наступил, " +
                    "и нужно немного подождать!"); }


    }
}