public class Main {
    public static void main(String[] args) {

        // Задача 2
        int age = 30;
        if (age >=7 && age < 18)  {
            System.out.println("Ребенок ходит в школу"); }
        if (age >= 18 && age < 24)  {
            System.out.println("Человек уже закончил школу и может отправляться в университет"); }
        if (age >= 24)  {
            System.out.println("Человек окончил университет и ему пора искать первую работу"); }
    }
}