public class Main {
    public static void main(String[] args) {

        // Задача 4

        int age = 2;
        if (age >=18)  {
            System.out.println("Вы совершеннолетний!");}
            else
            {System.out.println("Возраст совершеннолетия ещё не наступил, " +
                    "и нужно немного подождать!"); }

    }
}